In [4]:
import pandas as pd

In [6]:
df=pd.read_excel("E:\\python libraries\\s_13.xlsx")

In [7]:
df=pd.DataFrame(df)

In [8]:
df

,Units Sold,Manufacturing Price,Sale_Price,Gross,Price,COGS,Profit,Total
0,1618.5,3,20,32370.0,32370.0,16185,16185.0,97130.0
1,1321.0,3,20,26420.0,26420.0,13210,13210.0,79280.0
2,2178.0,3,15,32670.0,32670.0,21780,10890.0,98025.0
3,888.0,3,15,13320.0,13320.0,8880,4440.0,39975.0
4,2470.0,3,15,37050.0,37050.0,24700,12350.0,111165.0
5,1513.0,3,350,529550.0,529550.0,393380,136170.0,1589000.0
6,921.0,5,15,13815.0,13815.0,9210,4605.0,41460.0
7,2518.0,5,12,30216.0,30216.0,7554,22662.0,90660.0
8,1899.0,5,20,37980.0,37980.0,18990,18990.0,113960.0
9,1545.0,5,12,18540.0,18540.0,4635,13905.0,55632.0
10,2470.0,5,15,37050.0,37050.0,24700,12350.0,111165.0
11,2665.5,5,125,333187.5,333187.5,319860,13327.5,999687.5
12,958.0,5,300,287400.0,287400.0,239500,47900.0,862500.0
13,2146.0,5,7,15022.0,15022.0,10730,4292.0,45073.0
14,345.0,5,125,43125.0,43125.0,41400,1725.0,129500.0
15,615.0,5,15,9225.0,9225.0,6150,3075.0,27690.0
16,292.0,10,20,5840.0,5840.0,2920,2920.0,17540.0
17,974.0,10,15,14610.0,14610.0,9740,4870.0,43845.0
18,2518.0,10,12,30216.0,30216.0,7554,22662.0,90660.0

In [9]:
df[["Last Name","First Name"]].tail(-5)

KeyError: "None of [Index(['Last Name', 'First Name'], dtype='object')] are in the [columns]"

In [10]:
ddta=df.describe()

In [11]:
ddta

,Units Sold,Manufacturing Price,Sale_Price,Gross,Price,COGS,Profit,Total
count,19.000000,19.000000,19.000000,19.000000,19.000000,19.000000,19.000000,1.900000e+01
mean,1571.315789,5.157895,59.368421,81452.973684,81452.973684,62162.000000,19290.973684,2.444183e+05
std,787.309857,2.339591,100.121710,141408.760280,141408.760280,116847.846732,30266.246312,4.243175e+05
min,292.000000,3.000000,7.000000,5840.000000,5840.000000,2920.000000,1725.000000,1.754000e+04
25%,939.500000,3.000000,15.000000,14816.000000,14816.000000,8217.000000,4522.500000,4.445900e+04
50%,1545.000000,5.000000,15.000000,30216.000000,30216.000000,13210.000000,12350.000000,9.066000e+04
75%,2324.000000,5.000000,20.000000,37515.000000,37515.000000,24700.000000,17587.500000,1.125625e+05
max,2665.500000,10.000000,350.000000,529550.000000,529550.000000,393380.000000,136170.000000,1.589000e+06

In [12]:
ddta.to_excel("E:\\python libraries\\describe.xlsx")

In [13]:
df.shape

(19, 8)

In [14]:
ddta

,Units Sold,Manufacturing Price,Sale_Price,Gross,Price,COGS,Profit,Total
count,19.000000,19.000000,19.000000,19.000000,19.000000,19.000000,19.000000,1.900000e+01
mean,1571.315789,5.157895,59.368421,81452.973684,81452.973684,62162.000000,19290.973684,2.444183e+05
std,787.309857,2.339591,100.121710,141408.760280,141408.760280,116847.846732,30266.246312,4.243175e+05
min,292.000000,3.000000,7.000000,5840.000000,5840.000000,2920.000000,1725.000000,1.754000e+04
25%,939.500000,3.000000,15.000000,14816.000000,14816.000000,8217.000000,4522.500000,4.445900e+04
50%,1545.000000,5.000000,15.000000,30216.000000,30216.000000,13210.000000,12350.000000,9.066000e+04
75%,2324.000000,5.000000,20.000000,37515.000000,37515.000000,24700.000000,17587.500000,1.125625e+05
max,2665.500000,10.000000,350.000000,529550.000000,529550.000000,393380.000000,136170.000000,1.589000e+06

In [15]:
df.ndim

2

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.size

152

In [18]:
df.columns

Index(['Units Sold', 'Manufacturing Price', 'Sale_Price', 'Gross', 'Price',
       'COGS', 'Profit', 'Total'],
      dtype='object')

In [19]:
df[0:9:2]

,Units Sold,Manufacturing Price,Sale_Price,Gross,Price,COGS,Profit,Total
0,1618.5,3,20,32370.0,32370.0,16185,16185.0,97130.0
2,2178.0,3,15,32670.0,32670.0,21780,10890.0,98025.0
4,2470.0,3,15,37050.0,37050.0,24700,12350.0,111165.0
6,921.0,5,15,13815.0,13815.0,9210,4605.0,41460.0
8,1899.0,5,20,37980.0,37980.0,18990,18990.0,113960.0

In [20]:
lis=[10,20,30,40,50,60,20,30,300]

In [21]:
len(lis)

9

In [22]:
lis[0:9:2]

[10, 30, 50, 20, 300]

In [23]:
df.loc[0:10]

,Units Sold,Manufacturing Price,Sale_Price,Gross,Price,COGS,Profit,Total
0,1618.5,3,20,32370.0,32370.0,16185,16185.0,97130.0
1,1321.0,3,20,26420.0,26420.0,13210,13210.0,79280.0
2,2178.0,3,15,32670.0,32670.0,21780,10890.0,98025.0
3,888.0,3,15,13320.0,13320.0,8880,4440.0,39975.0
4,2470.0,3,15,37050.0,37050.0,24700,12350.0,111165.0
5,1513.0,3,350,529550.0,529550.0,393380,136170.0,1589000.0
6,921.0,5,15,13815.0,13815.0,9210,4605.0,41460.0
7,2518.0,5,12,30216.0,30216.0,7554,22662.0,90660.0
8,1899.0,5,20,37980.0,37980.0,18990,18990.0,113960.0
9,1545.0,5,12,18540.0,18540.0,4635,13905.0,55632.0
10,2470.0,5,15,37050.0,37050.0,24700,12350.0,111165.0

In [24]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [26]:
for i,j in df.iterrows():
    print(i,j[["Gross","Price"]])

0 Gross    32370.0
Price    32370.0
Name: 0, dtype: float64
1 Gross    26420.0
Price    26420.0
Name: 1, dtype: float64
2 Gross    32670.0
Price    32670.0
Name: 2, dtype: float64
3 Gross    13320.0
Price    13320.0
Name: 3, dtype: float64
4 Gross    37050.0
Price    37050.0
Name: 4, dtype: float64
5 Gross    529550.0
Price    529550.0
Name: 5, dtype: float64
6 Gross    13815.0
Price    13815.0
Name: 6, dtype: float64
7 Gross    30216.0
Price    30216.0
Name: 7, dtype: float64
8 Gross    37980.0
Price    37980.0
Name: 8, dtype: float64
9 Gross    18540.0
Price    18540.0
Name: 9, dtype: float64
10 Gross    37050.0
Price    37050.0
Name: 10, dtype: float64
11 Gross    333187.5
Price    333187.5
Name: 11, dtype: float64
12 Gross    287400.0
Price    287400.0
Name: 12, dtype: float64
13 Gross    15022.0
Price    15022.0
Name: 13, dtype: float64
14 Gross    43125.0
Price    43125.0
Name: 14, dtype: float64
15 Gross    9225.0
Price    9225.0
Name: 15, dtype: float64
16 Gross    5840.0
Price    5840.0
Name: 16, dtype: float64
17 Gross    14610.0
Price    14610.0
Name: 17, dtype: float64
18 Gross    30216.0
Price    30216.0
Name: 18, dtype: float64

In [286]:
df.loc[df["Last Name"]=="Steele"]

  Last Name First Name     Status  Salary  Age
9    Steele      Donna  Full Time   36750   43

In [58]:
df=pd.DataFrame(df)

In [59]:
df

    Last Name First Name     Status   Salary     Age
0    Williams       Mary  Full Time  35000.0     NaN
1       Brown        NaN  Full Time  32000.0    43.0
2      Wilson  Elizabeth  Part Time      NaN    40.0
3       Moore   Jennifer  Full Time  41000.0    43.0
4         NaN    Charles  Full Time  39000.0   323.0
5       Price       Lisa  Part Time  14000.0     3.0
6        Wood     Daniel        NaN  13750.0     4.0
7     Coleman     Donald  Full Time  37500.0    23.0
8       Perry        NaN  Part Time  12050.0     NaN
9      Steele      Donna  Full Time  36750.0    43.0
10    Schultz      Carol  Full Time      NaN    23.0
11      Munoz       Ruth  Part Time  11000.0    34.0
12   Chandler      Jason  Full Time  29000.0    23.0
13        NaN    Matthew  Full Time  45500.0    35.0
14    Hensley    Jessica  Full Time      NaN     NaN
15      Brown        NaN  Part Time   8000.0   233.0
16     Grimes       Jose        NaN  17000.0   535.0
17     Baxter     Brenda  Full Time  36000.0    40.0
18      Morin      Frank  Full Time      NaN   556.0
19    Tillman   Kathleen  Part Time   9750.0    40.0
20      Huber     Joshua        NaN  31750.0  6576.0
21      Boyle        NaN  Full Time      NaN    65.0
22    Buckner      Jerry  Full Time  37500.0    40.0
23    Knowles      Aaron  Part Time  10050.0     NaN
24  Velazquez        NaN  Part Time   9075.0     4.0
25       Vang    Marilyn        NaN  29750.0    43.0

In [73]:
data=df.loc[1:5,["Salary"]].fillna("Deepak")

In [75]:
data

    Salary
1  32000.0
2   Deepak
3  41000.0
4  39000.0
5  14000.0

In [76]:
df.sort_values("Salary",ascending=False)

    Last Name First Name     Status   Salary     Age
13        NaN    Matthew  Full Time  45500.0    35.0
3       Moore   Jennifer  Full Time  41000.0    43.0
4         NaN    Charles  Full Time  39000.0   323.0
22    Buckner      Jerry  Full Time  37500.0    40.0
7     Coleman     Donald  Full Time  37500.0    23.0
9      Steele      Donna  Full Time  36750.0    43.0
17     Baxter     Brenda  Full Time  36000.0    40.0
0    Williams       Mary  Full Time  35000.0     NaN
1       Brown        NaN  Full Time  32000.0    43.0
20      Huber     Joshua        NaN  31750.0  6576.0
25       Vang    Marilyn        NaN  29750.0    43.0
12   Chandler      Jason  Full Time  29000.0    23.0
16     Grimes       Jose        NaN  17000.0   535.0
5       Price       Lisa  Part Time  14000.0     3.0
6        Wood     Daniel        NaN  13750.0     4.0
8       Perry        NaN  Part Time  12050.0     NaN
11      Munoz       Ruth  Part Time  11000.0    34.0
23    Knowles      Aaron  Part Time  10050.0     NaN
19    Tillman   Kathleen  Part Time   9750.0    40.0
24  Velazquez        NaN  Part Time   9075.0     4.0
15      Brown        NaN  Part Time   8000.0   233.0
2      Wilson  Elizabeth  Part Time      NaN    40.0
10    Schultz      Carol  Full Time      NaN    23.0
14    Hensley    Jessica  Full Time      NaN     NaN
18      Morin      Frank  Full Time      NaN   556.0
21      Boyle        NaN  Full Time      NaN    65.0

In [70]:
df.sort_values(["Last Name"],ascending=False)

    Last Name First Name     Status   Salary     Age
6        Wood     Daniel        NaN  13750.0     4.0
2      Wilson  Elizabeth  Part Time      NaN    40.0
0    Williams       Mary  Full Time  35000.0     NaN
24  Velazquez        NaN  Part Time   9075.0     4.0
25       Vang    Marilyn        NaN  29750.0    43.0
19    Tillman   Kathleen  Part Time   9750.0    40.0
9      Steele      Donna  Full Time  36750.0    43.0
10    Schultz      Carol  Full Time      NaN    23.0
5       Price       Lisa  Part Time  14000.0     3.0
8       Perry        NaN  Part Time  12050.0     NaN
11      Munoz       Ruth  Part Time  11000.0    34.0
18      Morin      Frank  Full Time      NaN   556.0
3       Moore   Jennifer  Full Time  41000.0    43.0
23    Knowles      Aaron  Part Time  10050.0     NaN
20      Huber     Joshua        NaN  31750.0  6576.0
14    Hensley    Jessica  Full Time      NaN     NaN
16     Grimes       Jose        NaN  17000.0   535.0
7     Coleman     Donald  Full Time  37500.0    23.0
12   Chandler      Jason  Full Time  29000.0    23.0
22    Buckner      Jerry  Full Time  37500.0    40.0
15      Brown        NaN  Part Time   8000.0   233.0
1       Brown        NaN  Full Time  32000.0    43.0
21      Boyle        NaN  Full Time      NaN    65.0
17     Baxter     Brenda  Full Time  36000.0    40.0
4         NaN    Charles  Full Time  39000.0   323.0
13        NaN    Matthew  Full Time  45500.0    35.0

In [71]:
df.sort_values(["Age","Salary"],ascending=[1,0])

    Last Name First Name     Status   Salary     Age
5       Price       Lisa  Part Time  14000.0     3.0
6        Wood     Daniel        NaN  13750.0     4.0
24  Velazquez        NaN  Part Time   9075.0     4.0
7     Coleman     Donald  Full Time  37500.0    23.0
12   Chandler      Jason  Full Time  29000.0    23.0
10    Schultz      Carol  Full Time      NaN    23.0
11      Munoz       Ruth  Part Time  11000.0    34.0
13        NaN    Matthew  Full Time  45500.0    35.0
22    Buckner      Jerry  Full Time  37500.0    40.0
17     Baxter     Brenda  Full Time  36000.0    40.0
19    Tillman   Kathleen  Part Time   9750.0    40.0
2      Wilson  Elizabeth  Part Time      NaN    40.0
3       Moore   Jennifer  Full Time  41000.0    43.0
9      Steele      Donna  Full Time  36750.0    43.0
1       Brown        NaN  Full Time  32000.0    43.0
25       Vang    Marilyn        NaN  29750.0    43.0
21      Boyle        NaN  Full Time      NaN    65.0
15      Brown        NaN  Part Time   8000.0   233.0
4         NaN    Charles  Full Time  39000.0   323.0
16     Grimes       Jose        NaN  17000.0   535.0
18      Morin      Frank  Full Time      NaN   556.0
20      Huber     Joshua        NaN  31750.0  6576.0
0    Williams       Mary  Full Time  35000.0     NaN
8       Perry        NaN  Part Time  12050.0     NaN
23    Knowles      Aaron  Part Time  10050.0     NaN
14    Hensley    Jessica  Full Time      NaN     NaN

In [35]:
d=pd.read_excel("E:\\python libraries\\s_12.xlsx")

In [36]:
delta=pd.DataFrame(d)

In [37]:
delta

,Units Sold,Manufacturing Price,Sale_Price,Gross,Price,COGS,Profit
0,1618.5,3,20,32370,32370,16185,16185
1,1321.0,3,20,26420,26420,13210,13210
2,2178.0,3,15,32670,32670,21780,10890
3,888.0,3,15,13320,13320,8880,4440
4,2470.0,3,15,37050,37050,24700,12350
5,2470.0,3,15,37050,37050,24700,12350
6,921.0,5,15,13815,13815,9210,4605
7,2518.0,5,12,30216,30216,7554,22662
8,1899.0,5,20,37980,37980,18990,18990
9,1545.0,5,12,18540,18540,4635,13905
10,2470.0,5,15,37050,37050,24700,12350
11,2470.0,5,15,37050,37050,24700,12350
12,958.0,5,300,287400,287400,239500,47900
13,2146.0,5,7,15022,15022,10730,4292
14,345.0,5,125,43125,43125,41400,1725
15,615.0,5,15,9225,9225,6150,3075
16,292.0,10,20,5840,5840,2920,2920
17,292.0,10,20,5840,5840,2920,2920
18,2518.0,10,12,30216,30216,7554,22662

In [38]:
delta["Total_Values"]="miss"

In [39]:
delta

,Units Sold,Manufacturing Price,Sale_Price,Gross,Price,COGS,Profit,Total_Values
0,1618.5,3,20,32370,32370,16185,16185,miss
1,1321.0,3,20,26420,26420,13210,13210,miss
2,2178.0,3,15,32670,32670,21780,10890,miss
3,888.0,3,15,13320,13320,8880,4440,miss
4,2470.0,3,15,37050,37050,24700,12350,miss
5,2470.0,3,15,37050,37050,24700,12350,miss
6,921.0,5,15,13815,13815,9210,4605,miss
7,2518.0,5,12,30216,30216,7554,22662,miss
8,1899.0,5,20,37980,37980,18990,18990,miss
9,1545.0,5,12,18540,18540,4635,13905,miss
10,2470.0,5,15,37050,37050,24700,12350,miss
11,2470.0,5,15,37050,37050,24700,12350,miss
12,958.0,5,300,287400,287400,239500,47900,miss
13,2146.0,5,7,15022,15022,10730,4292,miss
14,345.0,5,125,43125,43125,41400,1725,miss
15,615.0,5,15,9225,9225,6150,3075,miss
16,292.0,10,20,5840,5840,2920,2920,miss
17,292.0,10,20,5840,5840,2920,2920,miss
18,2518.0,10,12,30216,30216,7554,22662,miss

In [40]:
delta["Total_Values"]=delta["Sale_Price"]+delta["Gross"]+delta["Price"]+delta["COGS"]+delta["Profit"]

In [41]:
delta

,Units Sold,Manufacturing Price,Sale_Price,Gross,Price,COGS,Profit,Total_Values
0,1618.5,3,20,32370,32370,16185,16185,97130
1,1321.0,3,20,26420,26420,13210,13210,79280
2,2178.0,3,15,32670,32670,21780,10890,98025
3,888.0,3,15,13320,13320,8880,4440,39975
4,2470.0,3,15,37050,37050,24700,12350,111165
5,2470.0,3,15,37050,37050,24700,12350,111165
6,921.0,5,15,13815,13815,9210,4605,41460
7,2518.0,5,12,30216,30216,7554,22662,90660
8,1899.0,5,20,37980,37980,18990,18990,113960
9,1545.0,5,12,18540,18540,4635,13905,55632
10,2470.0,5,15,37050,37050,24700,12350,111165
11,2470.0,5,15,37050,37050,24700,12350,111165
12,958.0,5,300,287400,287400,239500,47900,862500
13,2146.0,5,7,15022,15022,10730,4292,45073
14,345.0,5,125,43125,43125,41400,1725,129500
15,615.0,5,15,9225,9225,6150,3075,27690
16,292.0,10,20,5840,5840,2920,2920,17540
17,292.0,10,20,5840,5840,2920,2920,17540
18,2518.0,10,12,30216,30216,7554,22662,90660

In [42]:
delta["average"]=0

In [44]:
delta["average"]=delta["Total_Values"]/5

In [46]:
delta

,Units Sold,Manufacturing Price,Sale_Price,Gross,Price,COGS,Profit,Total_Values,average
0,1618.5,3,20,32370,32370,16185,16185,97130,19426.0
1,1321.0,3,20,26420,26420,13210,13210,79280,15856.0
2,2178.0,3,15,32670,32670,21780,10890,98025,19605.0
3,888.0,3,15,13320,13320,8880,4440,39975,7995.0
4,2470.0,3,15,37050,37050,24700,12350,111165,22233.0
5,2470.0,3,15,37050,37050,24700,12350,111165,22233.0
6,921.0,5,15,13815,13815,9210,4605,41460,8292.0
7,2518.0,5,12,30216,30216,7554,22662,90660,18132.0
8,1899.0,5,20,37980,37980,18990,18990,113960,22792.0
9,1545.0,5,12,18540,18540,4635,13905,55632,11126.4
10,2470.0,5,15,37050,37050,24700,12350,111165,22233.0
11,2470.0,5,15,37050,37050,24700,12350,111165,22233.0
12,958.0,5,300,287400,287400,239500,47900,862500,172500.0
13,2146.0,5,7,15022,15022,10730,4292,45073,9014.6
14,345.0,5,125,43125,43125,41400,1725,129500,25900.0
15,615.0,5,15,9225,9225,6150,3075,27690,5538.0
16,292.0,10,20,5840,5840,2920,2920,17540,3508.0
17,292.0,10,20,5840,5840,2920,2920,17540,3508.0
18,2518.0,10,12,30216,30216,7554,22662,90660,18132.0